# Pandas

## Pandas Serisi Oluşturmak

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
seri = pd.Series([1,2,3,4,5])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes # Bu serinin index bilgilerini verir

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [7]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [9]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [14]:
seri = pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

In [15]:
seri["a"]

99

In [16]:
seri["a" : "c"]

a     99
b     22
c    332
dtype: int64

In [17]:
# sozluk uzerinden liste olusturmak

In [18]:
sozluk = pd.Series({"reg": 10, "log": 11, "cart": 12})

In [19]:
sozluk

reg     10
log     11
cart    12
dtype: int64

In [20]:
seri = pd.Series(sozluk)

In [21]:
seri

reg     10
log     11
cart    12
dtype: int64

In [22]:
seri["reg" : "cart"]

reg     10
log     11
cart    12
dtype: int64

In [23]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## Eleman İşlemleri

In [25]:
import numpy as np

In [26]:
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [27]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [28]:
seri = pd.Series([121,20,150,99], 
                 index = ["reg","loj","cart","rf"] )

In [29]:
seri

reg     121
loj      20
cart    150
rf       99
dtype: int64

In [30]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [32]:
seri.keys

<bound method Series.keys of reg     121
loj      20
cart    150
rf       99
dtype: int64>

In [33]:
list(seri.items())

[('reg', 121), ('loj', 20), ('cart', 150), ('rf', 99)]

In [34]:
seri.values

array([121,  20, 150,  99], dtype=int64)

In [35]:
"reg" in seri

True

In [36]:
seri[["rf", "reg"]]

rf      99
reg    121
dtype: int64

In [37]:
seri["reg"] = 132

In [38]:
seri["reg" : "loj"]

reg    132
loj     20
dtype: int64

## Pandas DataFrame Olusturma

In [39]:
import numpy as np
import pandas as pd

In [40]:
l = [1,2,39,67,90]

In [41]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [42]:
m =np.arange(1,10).reshape((3,3))

In [43]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [45]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])

In [46]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [47]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [48]:
df.columns = ("deg1","deg2","deg3")

In [49]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [50]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [51]:
df.shape

(3, 3)

In [53]:
df.values    # sadece degerleri cekip bunları numpy arraye cevirir

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [54]:
type(df.values)

numpy.ndarray

## Pandas DataFrame Eleman İşlemleri

In [55]:
import numpy as np

In [56]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [57]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}
sozluk

{'var1': array([9, 5, 4, 4, 0]),
 'var2': array([8, 8, 0, 6, 0]),
 'var3': array([2, 6, 3, 5, 7])}

In [58]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     9     8     2
1     5     8     6
2     4     0     3
3     4     6     5
4     0     0     7

In [59]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [62]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     9     8     2
b     5     8     6
c     4     0     3
d     4     6     5
e     0     0     7

In [63]:
df["a": "d"]

   var1  var2  var3
a     9     8     2
b     5     8     6
c     4     0     3
d     4     6     5

In [64]:
df.drop("a", axis = 0, inplace = True)
df

   var1  var2  var3
b     5     8     6
c     4     0     3
d     4     6     5
e     0     0     7

In [65]:
# fancy ile coklu silme

In [66]:
l = ["c","e"]

In [67]:
df.drop(l, axis = 0)

   var1  var2  var3
b     5     8     6
d     4     6     5

In [68]:
l = ["var1", "var4", "var2"]

In [69]:
for i in l:
    print(i in df)

True
False
True

In [70]:
df["var1"]

b    5
c    4
d    4
e    0
Name: var1, dtype: int32

In [71]:
df["var4"] = df["var1"] * df["var2"]
df

   var1  var2  var3  var4
b     5     8     6    40
c     4     0     3     0
d     4     6     5    24
e     0     0     7     0

In [72]:
df.drop("var4", axis = 1, inplace = True)

In [73]:
df

   var1  var2  var3
b     5     8     6
c     4     0     3
d     4     6     5
e     0     0     7

In [74]:
l = ["var1", "var2"]

In [75]:
df.drop(l, axis = 1)

   var3
b     6
c     3
d     5
e     7

## Gözlem ve Değişken Seçimi: loc & iloc

In [76]:
import numpy as np
import pandas as pd

In [77]:
m = np.random.randint(1,30, size = (10,3))

In [78]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     3    11     9
1    17    25    10
2    20    21     1
3     1    13     5
4     2     1     6
5    23    12    27
6    26     7    26
7    11    25     1
8    29     2     9
9     6    17    25

**loc: tanımlandıgı sekliyle seçim yapmak için kullanılır.**

In [79]:
df.loc[0:3] # 3 dahil

   var1  var2  var3
0     3    11     9
1    17    25    10
2    20    21     1
3     1    13     5

**iloc: alışık oldugumuz indeksleme mantıgıyla secim yapar**

In [80]:
df.iloc[0:3] # 3 dahil degil

   var1  var2  var3
0     3    11     9
1    17    25    10
2    20    21     1

In [81]:
df.iloc[0,0]

3

In [82]:
df.iloc[:3, :2]

   var1  var2
0     3    11
1    17    25
2    20    21

In [83]:
df.loc[0:3, "var3"]

0     9
1    10
2     1
3     5
Name: var3, dtype: int32

**Değişken ismi veya indekslerin isimlerine göre secme işlemi yapmak istersek loc kullanılır. iloc bunu yapmaya izin vermez. Hata verir.**

In [85]:
# df.iloc[0:3 , "var3"]   Hata!

In [86]:
df.loc[0:3 , "var3"]

0     9
1    10
2     1
3     5
Name: var3, dtype: int32

In [87]:
df.iloc[0:3, 1:3]

   var2  var3
0    11     9
1    25    10
2    21     1

In [88]:
df.iloc[0:3]

   var1  var2  var3
0     3    11     9
1    17    25    10
2    20    21     1

In [89]:
df.iloc[0:3]["var3"]

0     9
1    10
2     1
Name: var3, dtype: int32

## Koşullu Eleman İşlemleri

In [91]:
import numpy as np
import pandas as pd

In [92]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     5     7     4
1    24    19     6
2    24    21    18
3    23     6     1
4    17    17    28
5    26    11    14
6    26    11     1
7     5    16    20
8    18    27    11
9     4    26    13

In [93]:
df["var2"][0:2]

0     7
1    19
Name: var2, dtype: int32

In [94]:
df[0:2]

   var1  var2  var3
0     5     7     4
1    24    19     6

In [95]:
df[0:2][["var1", "var2"]]

   var1  var2
0     5     7
1    24    19

In [96]:
df.var1

0     5
1    24
2    24
3    23
4    17
5    26
6    26
7     5
8    18
9     4
Name: var1, dtype: int32

In [97]:
df[df.var1 > 15 ]

   var1  var2  var3
1    24    19     6
2    24    21    18
3    23     6     1
4    17    17    28
5    26    11    14
6    26    11     1
8    18    27    11

In [98]:
df[df.var1 > 15]["var1"]

1    24
2    24
3    23
4    17
5    26
6    26
8    18
Name: var1, dtype: int32

In [99]:
df[(df.var1 > 15 ) & (df.var3 < 5)]

   var1  var2  var3
3    23     6     1
6    26    11     1

In [100]:
df.loc[(df.var1 > 15), ["var1", "var2"]]

   var1  var2
1    24    19
2    24    21
3    23     6
4    17    17
5    26    11
6    26    11
8    18    27

In [101]:
df[(df.var1 > 15)][["var1", "var2"]]

   var1  var2
1    24    19
2    24    21
3    23     6
4    17    17
5    26    11
6    26    11
8    18    27

## Birleştirme (Join) İşlemleri

In [102]:
import numpy as np
import pandas as pd

In [103]:
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    15    19    25
1    20     9     1
2    10     8    21
3     7    10    18
4    26    26    21

In [104]:
df2 = df1 + 99
df2

   var1  var2  var3
0   114   118   124
1   119   108   100
2   109   107   120
3   106   109   117
4   125   125   120

In [105]:
pd.concat([df1,df2])

   var1  var2  var3
0    15    19    25
1    20     9     1
2    10     8    21
3     7    10    18
4    26    26    21
0   114   118   124
1   119   108   100
2   109   107   120
3   106   109   117
4   125   125   120

In [106]:
pd.concat([df1,df2] , ignore_index = True)

   var1  var2  var3
0    15    19    25
1    20     9     1
2    10     8    21
3     7    10    18
4    26    26    21
5   114   118   124
6   119   108   100
7   109   107   120
8   106   109   117
9   125   125   120

In [107]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [108]:
df2.columns = ["var1","var2","deg3"]
df2

   var1  var2  deg3
0   114   118   124
1   119   108   100
2   109   107   120
3   106   109   117
4   125   125   120

In [109]:
df1

   var1  var2  var3
0    15    19    25
1    20     9     1
2    10     8    21
3     7    10    18
4    26    26    21

In [111]:
pd.concat([df1,df2])  # deg3 iki verisetinde de olmadıgı icin bunu problemli bir işlemmiş gibi algılayabilir

   var1  var2  var3   deg3
0    15    19  25.0    NaN
1    20     9   1.0    NaN
2    10     8  21.0    NaN
3     7    10  18.0    NaN
4    26    26  21.0    NaN
0   114   118   NaN  124.0
1   119   108   NaN  100.0
2   109   107   NaN  120.0
3   106   109   NaN  117.0
4   125   125   NaN  120.0

In [113]:
# Kesişimlerine göre birleştirelim.

In [112]:
pd.concat([df1,df2], join = "inner")

   var1  var2
0    15    19
1    20     9
2    10     8
3     7    10
4    26    26
0   114   118
1   119   108
2   109   107
3   106   109
4   125   125

In [114]:
pd.concat([df1,df2], join = "inner",
          ignore_index = True, axis =1)

    0   1   2    3    4    5
0  15  19  25  114  118  124
1  20   9   1  119  108  100
2  10   8  21  109  107  120
3   7  10  18  106  109  117
4  26  26  21  125  125  120

## İleri Birleştirme İşlemleri

In [115]:
import pandas as pd

In [116]:
# birebir birleştirme

In [117]:
df1 = pd.DataFrame ({"calisanlar": ["Ali", "Veli", "Hilal", "Fatma"],
                    "grup": ["Muhasebe", "Muhendislik", "Muhendislik", "IK"]})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2      Hilal  Muhendislik
3      Fatma           IK

In [118]:
df2 = pd.DataFrame({"calisanlar": ["Hilal", "Ali", "Veli", "Fatma"],
                   "ilk_giris": [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0      Hilal       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [119]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2      Hilal  Muhendislik       2010
3      Fatma           IK       2019

In [120]:
# merge() fonksiyonu birleştirmeyi hangi degişkene gore yapacagını kendisi belirliyor. 
# İki verisetinde de calisanlar oldugu için bunu calisanlara gore birleştirdi.

In [122]:
# hangi degişkene gore bırlestırecegını on ile belirleyebiliriz.

In [121]:
pd.merge(df1, df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2      Hilal  Muhendislik       2010
3      Fatma           IK       2019

In [123]:
# many to one (coktan teke) birleştirme

In [124]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2      Hilal  Muhendislik       2010
3      Fatma           IK       2019

In [125]:
df4 = pd.DataFrame({"grup": ["Muhasebe", "Muhendislik", "IK"],
                   "mudur": ["Caner", "Mustafa", "Berkcan"]})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [126]:
pd.merge(df3, df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2      Hilal  Muhendislik       2010  Mustafa
3      Fatma           IK       2019  Berkcan

In [127]:
# many to many (coktan coka) birleştirme

In [128]:
df5 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe", "Muhendislik", 
                             "Muhendislik","IK", "IK"],
                   "yetenekler": ["matematik", "excel", "kodlama", "linux",
                                 "excel", "yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [129]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2      Hilal  Muhendislik
3      Fatma           IK

In [130]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4      Hilal  Muhendislik    kodlama
5      Hilal  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim

## Toplulaştırma ve Gruplama (Aggregation & Grouping)

**Basit toplulaştırma fonksiyonları:**

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [132]:
import seaborn as sns

In [133]:
# seaborn kutuphanesindeki veri setlere ulaşmak için kullanılır

In [134]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [135]:
df.shape

(1035, 6)

In [136]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [137]:
df["mass"].mean()

2.6381605847953233

In [138]:
df["mass"].count()

513

In [142]:
df["mass"].min()

0.0036

In [143]:
df["mass"].std()

3.8186166509616046

In [144]:
df["mass"].var()

14.58183312700122

In [139]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [140]:
# verisetinde eksik degerlerin betimsel istatistiklerine bakmak istersek dropna kullanırız

In [141]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama Islemleri

In [145]:
df  = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                   "veri": [10, 11, 52,23, 43, 55]}, columns = ["gruplar", "veri"])

df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [146]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [147]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [148]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [149]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [150]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [151]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)

## Aggregate

In [152]:
import pandas as pd
import numpy as np

In [153]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                  "degisken1": [10, 23, 33, 22, 11, 99],
                  "degisken2": [100, 253, 333, 262, 111, 969]},
                 columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [155]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [156]:
df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [157]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

## Filter

In [158]:
import numpy as np
import pandas as pd

In [159]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                  "degisken1": [10, 23, 33, 22, 11, 99],
                  "degisken2": [100, 253, 333, 262, 111, 969]},
                 columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [160]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [161]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [162]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

## Transform

In [163]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                  "degisken1": [10, 23, 33, 22, 11, 99],
                  "degisken2": [100, 253, 333, 262, 111, 969]},
                 columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [164]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [165]:
df_a = df.iloc[:,1:3]

In [166]:
df_a.transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [167]:
df_a.transform(lambda x: ( x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

## Apply

In [168]:
df = pd.DataFrame({
                  "degisken1": [10, 23, 33, 22, 11, 99],
                  "degisken2": [100, 253, 333, 262, 111, 969]},
                 columns = [ "degisken1", "degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [169]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [170]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [171]:
df.apply(np.min)

degisken1     10
degisken2    100
dtype: int64

In [172]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                  "degisken1": [10, 23, 33, 22, 11, 99],
                  "degisken2": [100, 253, 333, 262, 111, 969]},
                 columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [173]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

## Pivot Tablolar

In [174]:
import pandas as pd
import seaborn as sns

In [175]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [176]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [177]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [178]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [179]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [181]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [183]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [190]:
# age surekli degiskenini bir kategorik degişkene çevirip bu kategorik değişkenin sınıflarını da pivot tabloya boyut olarak ekleyelim

In [186]:
age = pd.cut(titanic["age"], [10, 18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7             NaN
8    (18.0, 90.0]
9    (10.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(10, 18] < (18, 90]]

In [189]:
# bu islem sonucunda ortaya cıkan sınıfları pivot tabloya ekleyelim

In [188]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (10, 18]  1.000000  1.000000  0.523810
       (18, 90]  0.972973  0.900000  0.423729
male   (10, 18]  0.666667  0.000000  0.103448
       (18, 90]  0.375000  0.071429  0.133663